# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# n = int(input())
# summa = 0
# while n > 0:
#     x = n % 10
#     summa = summa + x
#     n = n // 10
# print(summa)


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# s = int(input("Введите общее количество журавликов: "))
# children = 3
# Petya = s // children // 2
# Serg = s // children // 2
# Kate = s // children * 2
# print(f"{s} -> {Petya} {Kate} {Serg}")


# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали
# билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых
# трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

# lucky_ticket = int(input('Введите шестизначный номер: '))
# a = lucky_ticket // 100000
# b = lucky_ticket % 100000 // 10000
# c = lucky_ticket % 10000 // 1000 
# k = lucky_ticket % 1000 // 100
# l = lucky_ticket % 100 // 10
# m = lucky_ticket % 10
# if(a + b + c == k + l + m):
#     print('ваш билет счастливый')
# else:
#     print('билет не является счастливым')


# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

# n = int(input())
# m = int(input())
# d = int(input())
# if d < n * m and d % n == 0 or d % m == 0:
#     print('можно')
# else:
#     print('нельзя')
